{
    "tba_header": "Sekcja w budowie",
    "years": "lat",
    "return_click_tile": "Wróć",
    "link": "Link",
    "see_also": "Zobacz też:",
    "currently": "obecnie",
    "i_can": "Potrafię m.in.:",
    "stack": "Technologie:",
    "clients": "Klienci:",
    "more": "Więcej",
    "footer_by_me": "Strona zbudowana w całości przeze mnie",
    "pages": {
        "Intro": "Intro",
        "Programista": "Programista",
        "Muzyk": "Muzyk",
        "Inne": "Inne"
    },
    "intro_about_me": "Mam na imię Wojtek i... powinienem napisać tu coś więcej.",
    "prg": {
        "intro": "Jestem software developerem pracującym w doświadczonej firmie informatycznej. Mam za sobą duże doświadczenie w programowaniu w wielu różnych językach i technologiach, które poznałem w toku edukacji oraz kariery zawodowej. Programowaniem zajmuję się nie tylko w pracy, ale także przy tworzeniu własnych projektów. Stale uczę się nowych technologii i poszerzam swoje kompetencje, żeby być jak najlepszym w tym, co robię.",
        "headings": {
            "exp": "Dotychczasowe doświadczenie",
            "langs": "Technologie, które znam",
            "projects": "Moje projekty",
            "timeline": {
                "up": "Edukacja",
                "down": "Praca"
            }
        },
        "edu":{
            "it": {
                "name": "Technikum informatyczne",
                "place": "Zespół Szkół Zawodowych w Wolsztynie",
                "summary": [
                    "pisać strony internetowe",
                    "montować i serwisować komputery",
                    "zarządzać i konfigurować urządzenia sieciowe"
                ]
            },
            "math": {
                "name": "Matematyka",
                "spec": "studia licencjackie: statystyka i analiza danych + dodatkowo przedmioty z matematyki finansowej",
                "place": "Uniwersytet im. Adama Mickiewicza w Poznaniu",
                "summary": [
                    "analizować i przetwarzać dane statystyczne",
                    "przeprowadzać zaawansowane obliczenia finansowe",
                    "testować hipotezy statystyczne (praca lic.)"
                ]
            },
            "econ": {
                "name": "Informatyka i Ekonometria",
                "spec": "studia magisterskie",
                "place": "Uniwersytet Ekonomiczny w Poznaniu",
                "summary": [
                    "budować i estymować szeregi czasowe"
                ]
            }
        },
        "jex": {
            "foram": {
                "name": "Sprzedawca e-commerce",
                "place": "FORAM Roman Krzyżanowski",
                "summary": [
                    "zarządzać szablonami produktów na portalach sprzedażowych (Allegro, Ebay, Amazon)",
                    "utrzymywać relacje z klientami B2B",
                    "tworzyć grafiki ofertowe i obrabiać zdjęcia"
                ],
                "rsm": [
                    "Moją pierwszą pracą związaną z IT była niewielka, ale popularna firma, którą polecił mi mój nauczyciel w technikum. Gdy do niej dołączałem, dowiedziałem się, że Wolsztyn, miasto, z którym miałem najwięcej do czynienia, okazał się być zagłębiem produkcji luster podświetlanych LED, a ja trafiłem do jednego z dwóch liderów na tym rynku w Polsce. Podczas mojego pobytu tam firma znacznie się rozwinęła, podbijając rynki zagraniczne, różne portale sprzedażowe i poszerzając swój asortyment.",
                    "Mój udział w tym sukcesie mogę określić jako nieznaczny, realizowałem za to pomysły przełożonych i pomagałem nawiązywać kontakty handlowe. Zajmowałem się głównie:",
                    [
                        "tworzeniem grafik produktowych: wraz z doświadczonymi grafikami tworzyłem wizualizacje wzorów luster i podświetleń. Pomagałem w odtworzeniu realistycznego wyglądu grafik i przez to bardzo dokładnie poznałem funkcje Photoshopa.",
                        "tworzeniem szablonów opisów produktów: na potrzeby wystawiania ofert na Allegro, Ebay oraz Amazon tworzyłem HTML-owe opisy ofert. Dopóki Ebay na to pozwalał, szablony były wzbogacone o elementy interaktywne sterowane JS.",
                        "zarządzaniem stroną domową: obecna strona artforma.pl wygląda zdecydowanie lepiej niż jej początki, jednak w jej wczesnej fazie istnienia zajmowałem się przedstawianą na niej ofertą. Strona była zbudowana na Wordpressie, a część rozszerzeń była modyfikowana ręcznie przez PHP.",
                        "raportowaniem sprzedaży: przygotowałem dzienne zestawienia wyników sprzedażowych na Allegro i Ebay za pomocą dostępnych narzędzi webscrapingowych (lub robiąc webscraping ręcznie). Zbierałem je w przystępne w odbiorze Excele i rozsyłałem do wiadomości kierownictwa.",
                        "kontaktem z klientami międzynarodowymi B2B: odbierałem ich zamówienia, nadawałem kody zniżkowe, kontaktowałem się, jeśli coś szło nie tak. Korespondencje były prowadzone w języku angielskim, okazjonalnie były to też rozmowy telefoniczne."
                    ],
                    "Poza tym udało mi się wprowadzić kilka usprawnień, głównie w zakresie wypełniania ofert na Ebay. Za pomocą prostych przeglądarkowych makr oraz Excelowego kokpitu, w którym je budowałem udało mi się przyspieszyć wpisywanie setek cen ponad stukrotnie."
                ]
            },
            "questy": {
                "name": "Software developer",
                "place": "Questy Business Software",
                "summary": [
                    "tworzyć dopasowane funkcjonalności aplikacji internetowych",
                    "pracować w środowisku agile"
                ],
                "clients": "Kompania Piwowarska, GLS, Filplast, Interhandler, Kospel, Dedra i in.",
                "rsm": [
                    "Questy to moja pierwsza praca, w której mógłbym z pełną śmiałością powiedzieć, że pracuję jako programista. Zatrudniłem się tam tuż po studiach licencjackich – początkowo chciałem podjąć pracę związaną ze studiowaną przeze mnie matematyką (coś z analizy danych?), jednak o wiele bardziej pewnie nadal czułem się w branży IT, z którą nadal wiązała mnie moja przeszłość i edukacja. Miałem jednak wysokie aspiracje i chciałem nadrobić stracony na studiach czas.",
                    "To też udało mi się osiągnąć na pokładzie Questy, współtworząc rozwiązania w wielu językach i technologiach, pracując na front- i backendzie oraz rozwiązując nierzadko nietypowe niedogodności klientów.",
                    "Sama firma, choć jej nazwa nie jest zbyt głośna, wspiera wielkich graczy z różnych gałęzi przemysłu. Jej flagowy produkt, jakim jest AuraCRM, znajduje uznanie u takich klientów jak Kompania Piwowarska, Interhandler czy GLS.",
                    "Produkty przeze mnie utrzymywane funkcjonują w wielu różnych technologiach i są pisane w wielu językach, stąd też udało mi się nabyć doświadczenie w:",
                    [
                        "PHP i Symfony: niestety aplikacja na chwilę pisania tych słów posiadała dość duży dług technologiczny i Symfony funkcjonowało w wersji 1.3, niemniej korzystałem z kilku funkcjonalności. Większość pracy odbywała się jednak w czystym PHP.",
                        "JS i jQuery: lwią część customizacji aplikacji przeprowadzałem za pomocą skryptów JS. Aplikacja wspiera także widoki React, jednak nie miałem okazji własnoręcznie pisać kodu frontendu, jedynie modyfikować już wynikowy render.",
                        "SQL: baza danych systemu pracuje na PostgreSQL, ale aplikacja posiada także rozbudowane możliwości synchronizacji z systemami zewnętrznymi, gdzie konieczna jest znajomość innych wariantów, np. MSSQL i MySQL.",
                        "Docker: cała aplikacja składa się z komponentów stojących na różnych kontenerach i do moich zadań należało m.in. koordynowanie ich pracy i diagnozowanie błędów."
                    ]
                ]
            },
            "promodruk": {
                "name": "Freelance software developer",
                "place": "PromoDruk Drukarnia Online",
                "summary": [
                    "pracować w niestandardowych technologiach webowych",
                    "dopasowywać istniejące rozwiązania do życzeń klienta"
                ]
            }
        },
        "proj": {
            "homepage": {
                "name": "Ta strona",
                "desc": "Moja strona domowa, funkcjonująca w pewnym sensie jako wizytówka/CV"
            },
            "msznm": {
                "name": "Usługi muzyczne",
                "desc": "CRM reklamujący i nadzorujący mój mini-biznes tworzenia podkładów muzycznych i nut"
            },
            "projorg": {
                "name": "Śpiewnik organisty",
                "desc": "Aplikacja tworząca listę pieśni wraz z nutami dla każdego możliwego programu mszy"
            },
            "sc": {
                "name": "Asystent kucharza",
                "desc": "DSS zarządzający wyposażeniem mojej kuchni; sugeruje, kiedy czego brakuje i co można ugotować"
            },
            "brz": {
                "name": "Własne radio",
                "desc": "Prosty odtwarzacz muzyczny poświęcony mojej własnej twórczości"
            },
            "krk": {
                "name": "Sekretarz korepetytora",
                "desc": "Aplikacja nadzorująca sesje, zarobki i uczniów korepetytora, z integracją z Google Calendar"
            },
            "cg": {
                "name": "Biblioteka tekstów",
                "desc": "Strona gromadząca i wyświetlająca teksty piosenek na potrzeby mojego zespołu weselnego"
            },
            "cc": {
                "name": "Krupier",
                "desc": "Mini-apka służąca jako wirtualna kartka papieru dla analogowo granych gier"
            },
            "hh": {
                "name": "Poszukiwacz domu",
                "desc": "Strona pozwalająca porównywać wybrane oferty domów i mieszkań"
            }
        }
    },
    "mus": {
        "headings": {
            "edu": "Edukacja muzyczna",
            "bands": "Z kim gram",
            "instr": "Na czym gram",
            "mine": "Moja twórczość"
        },
        "edu": {
            "place": "Państwowa Szkoła Muzyczna I st. im. Ireny Pfeiffer w Wolsztynie"
        },
        "bands": {
            "dixie": {
                "name": "Dixie Kings",
                "genre": "swing, jazz nowoorleański",
                "instruments": "banjo, gitara"
            },
            "wih": {
                "name": "Wihajster",
                "genre": "muzyka taneczna z okresu międzywojnia",
                "instruments": "tuba"
            },
            "pwod": {
                "name": "Powiatowa Wolsztyńska Orkiestra Dęta",
                "genre": "od muzyki klasycznej do rozrywkowej",
                "instruments": "gitara basowa, tuba, trąbka"
            },
            "az": {
                "name": "Audio Z",
                "genre": "oprawa muzyczna ślubów, wesel i imprez okoliczności",
                "instruments": "trąbka, saksofon, klarnet basowy"
            },
            "rr": {
                "name": "Roses Roots",
                "genre": "reggae",
                "instruments": "saksofon, gitara, gitara basowa"
            },
            "swietl": {
                "name": "ViolArte Wolsztyn",
                "genre": "oprawa muzyczna ślubów i występy kameralne",
                "instruments": "organy, fortepian"
            },
            "org": {
                "name": "Organista",
                "genre": "oprawa mszy",
                "instruments": "organy"
            }
        },
        "instr": [
            "gitara klasyczna", "gitara elektryczna", "gitara basowa",
            "ukulele", "mandolina",
            "fortepian", "organy piszczałkowe", "organy elektryczne",
            "trąbka", "saksofon tenorowy", "flet poprzeczny", "klarnet basowy", "obój", "tuba", "flet piccolo", "flugelhorn",
            "instrumenty perkusyjne", "harmonijka", "akordeon"
        ],
        "mine": {
            "msznm": {
                "about": "Pomagam innym spełniać muzyczne marzenia, tworząc dla nich spersonalizowane podkłady muzyczne i nuty",
                "heading": "Kompleksowe usługi muzyczne",
                "label": "Muzyka Szyta Na Miarę"
            },
            "hydrophilia": {
                "about": "Samodzielnie tworzę własne utwory łączące ciężkie brzmienia gitarowe, elektronikę oraz instrumenty dęte",
                "heading": "Własne utwory",
                "label": "Hydrophilia"
            }
        }
    },
    "alt": {
        "headings": {
            "whatelse": "Co jeszcze lubię robić",
            "favmedia": "Ulubione media"
        },
        "whatelse": {
            "languages": {
                "label": "Języki",
                "desc": "Lubię uczyć się języków, zwłaszcza odbiegających od tego, co już umiem. Tłumaczenia na tej stronie są robione w całości przeze mnie."
            },
            "drawing": {
                "label": "Rysunek",
                "desc": "Lubię rysować, zwłaszcza w monochromie. Udało mi się nawet zaprojektować autorską talię do tarota.",
                "tarot": "Moja talia do tarota"
            }
        }
    },
    "rodo": [
        "Wyrażam zgodę na przetwarzanie moich danych osobowych przez Państwa firmę w celu prowadzenia rekrutacji na aplikowane przeze mnie stanowisko.",
        "Wyrażam również zgodę na przetwarzanie moich danych osobowych w celu prowadzenia przyszłych rekrutacji przez Państwa firmę."
    ]
}